<?php
//Задание 1
$i = 0;

while ($i <= 100) {
    if ($i % 3 == 0) {
        echo " $i ";
    }
    $i++;
}

echo "<br>";

//Задание 2
$a = 0;

do {
    if ($a == 0) {
        echo "$a - ноль <br>";
    } elseif ($a % 2 == 0) {
        echo "$a - четное число <br>";
    } else {
        echo "$a - нечетное число <br>";
    }
    $a++;
} while ($a <= 10);

echo "<br>";

//Задание 3
$cities = ["Московская область" => ["Москва", "Зеленоград", "Клин"]
          ,"Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"]
          ,"Рязанская область" => ["Рязань", "Касимов", "Скопин", "Михайлов"]];

foreach ($cities as $key => $region){
    echo "<p> $key: <br>".implode(', ', $region)."</p>";
}

echo "<br>";

//Задание 4
function transliterate($text) {

    $alphabet = [
        "а" => "a",  "б" => "b",  "в"  => "v", "г"  => "g", "д"  => "d",  "е"  => "e",
        "ё" => "yo", "ж" => "zh", "з"  => "z", "и"  => "i", "й"  => "j",  "к"  => "k",
        "л" => "l",  "м" => "m",  "н"  => "n", "о"  => "o", "п"  => "p",  "р"  => "r",
        "с" => "s",  "т" => "t",  "у"  => "u", "ф"  => "f", "х"  => "x",  "ц"  => "c",
        "ч" => "ch", "ш" => "sh", "щ"  => "sch", "ь"  => "'", "ы"  => "yh", "ъ"  => "'",
        "э" => "eh", "ю" => "yu", "я"  => "ya",

        "А" => "A",  "Б" => "B",  "В"  => "V", "Г"  => "G", "Д"  => "D",  "Е"  => "E",
        "Ё" => "YO", "Ж" => "ZH", "З"  => "Z", "И"  => "I", "Й"  => "J",  "К"  => "K",
        "Л" => "L",  "М" => "M",  "Н"  => "N", "О"  => "O", "П"  => "P",  "Р"  => "R",
        "С" => "S",  "Т" => "T",  "У"  => "U", "Ф"  => "F", "Х"  => "X",  "Ц"  => "C",
        "Ч" => "CH", "Ш" => "SH", "Щ"  => "W", "Ь"  => "'", "Ы"  => "YH", "Ъ"  => "`",
        "Э" => "EH", "Ю" => "YU", "Я"  => "YA",
    ];

    return strtr($text, $alphabet);
}

echo transliterate('Ночь, улица, фонарь, аптека, Бессмысленный и тусклый свет.');

echo "<br>";

//Задание 5
function replacer($replaceValue, $valueForReplacement, $text) {
    return str_replace($replaceValue, $valueForReplacement, $text);
}

echo replacer(' ', '_', 'Ночь, улица, фонарь, аптека, Бессмысленный и тусклый свет.');

echo "<br>";

//Задание 6
$menu = [
    'Item1' => ['Ночь', 'улица'],
    'Item2' => ['фонарь', 'аптека'],
    'Item3' => ['Бессмысленный и тусклый свет'],
];
echo '<ul>';
foreach ($menu as $key => $val) { ?>
    <li><?php echo $key; ?>  

        <ul>
            <?php

            foreach ($val as $item) { ?>      
                <li><?php echo $item; ?></li>
            <?php }

            ?>
        </ul>

    </li>
<?php }
echo '</ul>';


echo "<br>";

//Задание 7
for($i = 0; $i < 10; print $i++) {}

?>

